; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v1 - type_1 ?v4 - type_3)
 	      (pred_1 ?v6 - object ?v4 - type_3)
	      (pred_4 ?v1 - type_1 ?v3 - type_2)
	      (pred_2 ?v1 - type_1 ?v6 - object ?v3 - type_2))

   (:action op_3
       :parameters  (?v1 - type_1 ?v5 ?v2 - type_3)
       :precondition (and  (pred_3 ?v1 ?v5))
       :effect (and  (pred_3 ?v1 ?v2)
		     (not (pred_3 ?v1 ?v5))))

   (:action op_2
       :parameters (?v1 - type_1 ?v7 - object ?v8 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v8) (pred_3 ?v1 ?v8) (pred_4 ?v1 ?v3))
       :effect (and (pred_2 ?v1 ?v7 ?v3)
		    (not (pred_1 ?v7 ?v8)) 
		    (not (pred_4 ?v1 ?v3))))

   (:action op_1
       :parameters (?v1 - type_1 ?v7 - object ?v8 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v7 ?v3) (pred_3 ?v1 ?v8))
       :effect (and (pred_1 ?v7 ?v8)
		    (pred_4 ?v1 ?v3)
		    (not (pred_2 ?v1 ?v7 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_09 obj_08 - type_1
obj_10 obj_04 obj_03 obj_11 - type_2
obj_12 obj_07 obj_06 obj_05 - type_3
obj_02 obj_01 obj_13 - object)
(:init
(pred_3 obj_09 obj_12)
(pred_4 obj_09 obj_10)
(pred_4 obj_09 obj_04)
(pred_3 obj_08 obj_12)
(pred_4 obj_08 obj_03)
(pred_4 obj_08 obj_11)
(pred_1 obj_02 obj_12)
(pred_1 obj_01 obj_05)
(pred_1 obj_13 obj_12)
)
(:goal
(and
(pred_1 obj_02 obj_07)
(pred_1 obj_01 obj_06)
(pred_1 obj_13 obj_05)
)
)

(:constraints
  (always (not (pred_3 obj_09 obj_06)))
)
)

; plan
1. (op_2 obj_08 obj_02 obj_12 obj_11)
   deleted: (pred_1 obj_02 obj_12) (pred_4 obj_08 obj_11)
   added: (pred_2 obj_08 obj_02 obj_11)
   goals met: 0 of 3
2. (op_2 obj_09 obj_13 obj_12 obj_04)
   deleted: (pred_1 obj_13 obj_12) (pred_4 obj_09 obj_04)
   added: (pred_2 obj_09 obj_13 obj_04)
   goals met: 0 of 3
3. (op_3 obj_08 obj_12 obj_07)
   deleted: (pred_3 obj_08 obj_12)
   added: (pred_3 obj_08 obj_07)
   goals met: 0 of 3
4. (op_3 obj_09 obj_12 obj_05)
   deleted: (pred_3 obj_09 obj_12)
   added: (pred_3 obj_09 obj_05)
   goals met: 0 of 3
5. (op_1 obj_09 obj_13 obj_05 obj_04)
   deleted: (pred_2 obj_09 obj_13 obj_04)
   added: (pred_1 obj_13 obj_05) (pred_4 obj_09 obj_04)
   goals met: 1 of 3
6. (op_1 obj_08 obj_02 obj_07 obj_11)
   deleted: (pred_2 obj_08 obj_02 obj_11)
   added: (pred_1 obj_02 obj_07) (pred_4 obj_08 obj_11)
   goals met: 2 of 3
7. (op_3 obj_08 obj_07 obj_05)
   deleted: (pred_3 obj_08 obj_07)
   added: (pred_3 obj_08 obj_05)
   goals met: 2 of 3
8. (op_2 obj_08 obj_01 obj_05 obj_11)
   deleted: (pred_1 obj_01 obj_05) (pred_4 obj_08 obj_11)
   added: (pred_2 obj_08 obj_01 obj_11)
   goals met: 2 of 3
9. (op_3 obj_08 obj_05 obj_06)
   deleted: (pred_3 obj_08 obj_05)
   added: (pred_3 obj_08 obj_06)
   goals met: 2 of 3
10. (op_1 obj_08 obj_01 obj_06 obj_11)
   deleted: (pred_2 obj_08 obj_01 obj_11)
   added: (pred_1 obj_01 obj_06) (pred_4 obj_08 obj_11)
   goals met: 3 of 3
